from utils import SUBJECTS

MENTAL_HEALTH_SUBJECTS = [
  {
    "subject_name": "سلامت معنوی در موقعیت کاهش استقلال",
    "subject_id": SUBJECTS.LOSS_OF_INDEPENDENCE.value,
    "secondary_subjects": [
      {
        "subject_name": "ربوبیت باوری",
        "aspect": "شناخت",
        "relational_reference": "خدا",
        "description": "سالمند دارای سلامت معنوی به رب بودن پروردگار در هستی باور دارد. این باور که رب و پرورش دهنده همه یکی است و در طول همه مسولیتها خداوند قرار میگیرد پذیرش سالمند را نسبت به تغییر نقش و جایگاه فعلی اش افزایش می دهد.",
      },
      {
        "subject_name": "وسعت بخشی معنای استقلال",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "وقتی سالمند استقلال را به معنای تسلط بر همه امور و مستقل عمل کردن مانند دوره جوانی بداند پذیرش شرایط جدید که محصول کاهش توانمندیها و تغییر اغتضاعات زندگی است برای وی دشوار خواهد شد. اگر سالمند پذیرا بودن نسبت به حمایت دیگران را به کاهش استقلال تعبیر نکند و استقلال برای او به مفاهیم فرامادی هم گسترش یافته باشد، در واقع سالمند می تواند از این رنج با سلامت معنوی عبور کند به عنوان مثال یک سالمند ممکن است عدم توانایی برای رانندگی را کاهش استقلال تلقی کند و از آن رنج ببرد و سالمند دارای سلامت معنوی استقلال در اندیشه و صاحب نظر بودن در مسایل اجتماعی را با اهمیت تر بداند و خلاء کاهش استقلال در امور زیستی را با افزایش استقلال در امور فرامادی چون اندیشه و رای مستقل جبران کرده و معنای استقلال را توسعه دهد.",
      },
      {
        "subject_name": "عملگرایی و انتخابگری به سبک جدید",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "ممکن است سالمند به دلیل کاهش توانمندیها دچار انزوا و انفعال شود و در حوزه تصمیم گیری و از کارهایی که در حد توان جسمی میتواند انجام دهد نیز کناره گیری کند در مقابل سالمند دارای سلامت معنوی عملگرايی خود را از دست نمی دهد و کماکان نقش فعال در تصمیم گیریها ایفا میکند سالمند دارای سلامت معنوی می تواند در عين استفاده از خدمات دیگران عاملیت داشته و به سبک جدید کماکان نقش آفرین باشد مثل سالمندی که دیگر نمی تواند رانندگی کند ولی خودش با استفاده از اپلیکیشنهای موجود تاکسی اینترنتی رزرو میکند و استقلال در عین خدمت پذیری را تجربه می کند.",
      },
      {
        "subject_name": "خدمت پذیری",
        "aspect": "رفتار",
        "relational_reference": "دیگران",
        "description": "سالمندان به دلیل تغییرات جسمی ناگزیر از کمک گرفتن از دیگران هستند اگر این کمک گرفتن برای آنها معنای خدمت پذیری داشته باشد و بتوانند در حین پذیرش خدمات دیگران عواطف و افکار خود را مدیریت کنند و احساس ضعف و حقارت به خود راه ندهند از سلامت معنوی برخوردار هستند. همچنین سالمند میتواند استقلال خود را در گزینش خادمین اعمال کند به عنوان مثال از خدمات فرزندی که با او احساس راحتی بیشتری دارد بهره مند شود.",
      },
      {
        "subject_name": "خود ابرازگری در ایتمندانه",
        "aspect": "رفتار",
        "relational_reference": "دیگران",
        "description": "سالمند دارای سلامت معنوی میتواند در عین پذیرش حمایت دیگران نیازهای خود را به صورت جرات مندانه ابراز کند سالمند میتواند با درایتمندی از استعاره شوخ طبعی و تمثیل برای بیان نظرات و انتقادات خود بهره ببرد. سالمند با سخن سنجی و صراحت بیان میتواند در عین استفاده از خدمات دیگران جرات مندانه نیازهای خود را به گونه ای خوشایند ابراز کند به عنوان مثال سالمند میتواند با بیان تمثیلی یا طنزگونه از فرزند خود بخواهد برای پیگیری های پزشکی از قبل زمان را با او نیز هماهنگ کند و فقط بر اساس شرایط خودش برنامه ریزی نکند.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در موقعیت کاهش کنشگری اجتماعی",
    "subject_id": SUBJECTS.LOSS_OF_SOCIAL_ACTIVITY.value,
    "secondary_subjects": [
      {
        "subject_name": "باز تعریف سبک کنشگری اجتماعی",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "سالمند دارای سلامت معنوی بعد از بازنشستگی و کاهش ارتباطات اجتماعی نیز کماکان کنشگری اجتماعی خود را به سبک جدید ادامه داده و دچار انفعال نمیشود سالمند دارای سلامت معنوی با نگاهی واقع بینانه به شرایط جدید خود سبک کنشگری را تغییر میدهد ولی کماکان به دنبال سهم گذاری اجتماعی است. مثلا معلم بازنشسته ای که با توجه به شرایط جسمی خود به آموزش مجازی پرداخته است و ارتباطات اجتماعی خود را در به صورت برخط پیگیری می کند.",
      },
      {
        "subject_name": "اهتمام ورزی به انتقال تجارب",
        "aspect": "رفتار",
        "relational_reference": "دیگران",
        "description": "سالمند دارای سلامت معنوی در گام اول به انتقال تجارب خود به دیگران مشتاق و علاقه مند است. در مرحله بعد اقدام به انتقال تجربیات میکند و در این مسیر نیز مهارت کسب میکند به طور مثال ابتدا برای انتقال تجربه به افراد مختلف نیازسنجی میکند و با در نظر گرفتن شرایط آنها اقدام به انتقال تجربیات میکند. همچنین قبل از انتقال تجربه نسبت به اینکه در طرف مقابل پذیرش برای بیان این تجارب وجود دارد یا نه امکان سنجی میکند. سالمند دارای سلامت معنوی خود به ارزشمندی فرایند انتقال تجربیات باور دارد.",
      },
      {
        "subject_name": "روایت فعالانه از تجارب اجتماعی و شغلی",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "سالمند دارای سلامت معنوی نگاه جامعی به تجارب شغلی و اجتماعی گذشته خود دارد. بدین معنی که میتواند تلخ و شیرین و فراز و فرود زندگی را در کنار هم ببیند و زندگی حرفه ای و اجتماعی خود را مجموعه ای از این تجربیات بداند همچنین سالمند شرایط زمینه ساز و بستری که رویدادها در آن اتفاق افتاده را در نظر می گیرد. این سالمندان میتوانند بستر فکری و زمینه تصمیمات و تجربیات گذشته خود و نیز دیگرانی که در آن موضوعات موثر بوده اند را در نظر بگیرد. سالمند قادر است تجارب خود را عاملانه روایت کند و نقشی که در خوب و بد اتفاقات گذشته داشته است را ببیند و بیان کند. این سالمندان خود را افرادی منفعل نمی بینند و به اثر بخشی خود در موقعیتهای مختلف اشاره می کنند.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی با وجود کاهش سلامت جسمی و مشکلات جنسی",
    "subject_id": SUBJECTS.PHYSICAL_HEALTH_AND_SEXUAL_ISSUES.value,
    "secondary_subjects": [
      {
        "subject_name": "باورمندی به قاعده سبب و مسبب",
        "aspect": "شناخت",
        "relational_reference": "جهان",
        "description": "سالمند دارای سلامت معنوی قادر است کاهش سلامت جسمی خود را با قاعده علت و معلول تبیین کند.",
      },
      {
        "subject_name": "پذیرندگی",
        "aspect": "احساس",
        "relational_reference": "خود",
        "description": "سالمند دارای سلامت معنوی نسبت به تغییرات طبیعی جسمی پذیرش داشته و نیازی به افسوس و حسرت و پناه بردن به مفاهیم خرافی و غیر عقلانی ندارد.",
      },
      {
        "subject_name": "خود مراقبتی",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "سالمندان دارای سلامت معنوی با توجه به کاهش توانمندیهای جسمی از خود مراقبتی بیشتری برخوردار هستند. این سالمندان هم مراقبتگری های پیشگیرانه دارند و هم در شرایط بحران و مواقعی که نیاز به درمان وجود دارد اقدامات لازم را مسولانه انجام میدهند. همچنین این سالمندان در امورات مربوط به خودمراقبتی حمایت پذیر هستند و از پذیرش کمک دیگران امتناع نمی کنند.",
      },
      {
        "subject_name": "ارزش گذاری به تصویر بدنی",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "رنج ناشی از مشکلات جنسی معمولا با بازتعریف معنای جذابیتهای جسمی و جنسی از بین خواهد رفت به عنوان مثال اینکه سالمند موی سفید و چهره جا افتاده خود را حامل پیام سالها زیست در دنیا و تجربه تلخ و شیرین آن بداند معنایی فراتر از فانتزی های برساخت رسانه از زیبایی برای او به دنبال می آورد. همچنین بخشی از این چالش با پذیرش طبیعی بودن تغییرات جسمی هموار خواهد شد. به عنوان نمونه در رابطه جنسی با پذیرش اینکه به دلیل تغییرات هورمونی وزن لذت زیستی کاهش یافته و لذتهای فرامادی مثل معاشقه زوجی که سالهای طولانی به یکدیگر وفادار بوده اند، معنادار می شود.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی هنگام مرگ نزدیکان و ترس از مرگ",
    "subject_id": SUBJECTS.LOSS_OF_CLOSE_ONES_AND_FEAR_OF_DEATH.value,
    "secondary_subjects": [
      {
        "subject_name": "باورمندی به تداوم هستی",
        "aspect": "شناخت",
        "relational_reference": "خدا",
        "description": "سالمند دارای سلامت معنوی با باورمندی به معاد مرگ را پایان زندگی نمیداند و این نگرش به تنهایی بخش زیادی از اضطرابها در مواجهه با مرگ را کاهش خواهد داد.",
      },
      {
        "subject_name": "تسلیم و رضا",
        "aspect": "احساس",
        "relational_reference": "خدا",
        "description": "رضایتمندی شامل رضایت قلبی رضایت کلامی و رضایت عملی است. سالمند دارای سلامت معنوی ممکن است به هر یک از سطوح رضایت در مواجهه با مرگ نزدیکان یا ترس از مرگ خود دست یافته باشد.",
      },
      {
        "subject_name": "رحلت نگری بیدار گرانه",
        "aspect": "شناخت",
        "relational_reference": "خدا",
        "description": "در رحلت نگری بیدار گرانه نگاه سالمند به مرگ نوعی هشدار و آگاهی از زمانی است که در گذر است. و به تعبیری مرگ برای او مفهوم مجال آگاهی در بردارد سالمند رحلت نگر نسبت به مرگ پذیرش دارد و از مرگ نمی ترسند. آنها نه تنها مرگ آگاه هستند بلکه مرگ برای آنان معنای ترسناک و نابودی ندارد بلکه بخشی از یک سفر است. رحلت نگری بیدار گرانه به گونه ای است که مرگ به جای فرو بردن سالمند در غم و رنج و اضطراب او را به تفکر وا می دارد.",
      },
      {
        "subject_name": "خود آرامسازی در پناه مناسک",
        "aspect": "رفتار",
        "relational_reference": "خدا",
        "description": "سالمندانی که با مناسک دینی انس داشته و در به جای آوردن مناسک نیز مداومت و انضباط دارند معمولا در مواجهه با اضطرابهای مختلف از جمله اضطراب مرگ از آرامش و سلامت معنوی بیشتری برخوردار هستند.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در موقعیت کاهش ارتباطات خانوادگی",
    "subject_id": SUBJECTS.LOSS_OF_FAMILY_CONNECTIONS.value,
    "secondary_subjects": [
      {
        "subject_name": "بازبینی و بازآفرینی ارتباطی",
        "aspect": "شناخت",
        "relational_reference": "دیگران",
        "description": "سالمندان دارای سلامت معنوی در این دوره از زندگی هم بازبینی در ارتباطات خود انجام می دهند و برخی ارتباطات را اختیارا کمتر و برخی را بیشتر میکنند آنها در این دوره ارتباطهای عمقی را به روابط سطحی و مرسوم ترجیح می دهند و ممکن است بر همین مبنا ارتباطات جدیدی شکل دهند. سالمند حتی گاهی انتخاب میکند که برای خود زمان خلوت بیشتری نسبت به قبل داشته باشد و یا مرزهای ارتباطی اش را شفاف تر سازد.",
      },
      {
        "subject_name": "احسان مداری ارتباطی",
        "aspect": "رفتار",
        "relational_reference": "دیگران",
        "description": "با توجه به تفاوت دوره سنی و نیازهای سالمند با اطرافیان سالمندانی قادر به حفظ ارتباطات خود با اطرافیان هستند که رابطه ای بر مبنای احسان برقرار سازند. احسان مداری ارتباطی یعنی پیوند جویی مشفقانه که در آن سالمند اهل مراعات ورزی اقدامات مهرورزانه همراهی بی توقع با دیگران دغدغه مندی نسبت به مسایل افراد دیگر و افزایش همدلی است. احسان مداری یعنی استفاده درایت مندانه از زبان و بیان نیازها با ملایمت و هوشمندی احسان مداری یعنی صلح آفرین بودن و ایجاد سازش و مدارا در بین افراد زبان خیر داشتن و تغافل ورزی و کش ندادن بحثها و تعارضات به دلیل روحیه صلح دوستی.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در شرایط تغییر سبک زندگی",
    "subject_id": SUBJECTS.LIFESTYLE_CHANGES.value,
    "secondary_subjects": [
      {
        "subject_name": "انطباق پذیری",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "در انطباق پذیری با تغییرات سبک زندگی سالمند دارای سلامت معنوی اولا قادر به درک تغییرات حاصل از این دوره زندگی خود است ثانيا قادر به انطباق واقع بینانه با این تغییرات است. همچنین سالمند قادر است به طور واقع بینانه ای با تغییر اولویت های زندگی انطباق پیدا کند به طور مثال اگر در گذشته روزی 8 ساعت کار میکرده و سفرهای کاری زیادی داشته الان قادر است توجه به سلامت جسمی را در اولویت قرار دهد.",
      },
      {
        "subject_name": "طبیعت نوازی",
        "aspect": "رفتار",
        "relational_reference": "جهان",
        "description": "طبیعت نوازی یعنی نظر به طبیعت به عنوان نشانه الهی تفکر در طبیعت و مراقبت از طبیعت مراقبت گری نسبت به گیاهان حیوانات آب و خاک و محیط زیست همه از مصادیق طبیعت نوازی هستند.",
      },
      {
        "subject_name": "باز تعریف معنای زندگی",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "باز تعریف معنای زندگی یعنی سالمند بتواند با معنا آفرینی در امور کوچک نشاط آفرینی مناسک محور و نشاط آفرینی در روزمرگیها تغییرات سبک زندگی را برای خود مطلوب نموده و معنای نشاط را از انجام کارهای بزرگ و تحولات روزانه به توجه به معانی و لذت عمیق نهفته در امور کوچک یا روزمره و فرا مادی تغییر دهد.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در موقعیت کاهش درآمد مالی",
    "subject_id": SUBJECTS.LOSS_OF_INCOME.value,
    "secondary_subjects": [
      {
        "subject_name": "روزآمدسازی روشهای درآمدزایی",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "وقتی سالمند قادر به فراروی از سبک کسب درآمد سابق خود بوده و برای شناخت روش های کسب درآمد جدید با در نظر داشتن محدودیتهای خود تلاش کند و در این مسیر با دیگران مشورت کرده سپس اقدام به درآمدزایی به سبک نوین بنماید در واقع توانسته روشهای درآمدزایی خود را روزآمد کند.",
      },
      {
        "subject_name": "توسعه معنای دارایی",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "جامع نگری دستاوردهای مادی و معنوی زندگی و اولویت گذاری ارزشی دستاوردهای غیرمادی منجر به توسعه معنای دارای در ذهن سالمند خواهد شد. همچنین مقایسه های افزاینده یعنی مقایسه با افراد پایین تر از خود در امور مادی و مقاسه با افراد بالاتر از خود در امورات غیرمادی موجب توسععه معنای دارایی میشود. به عنوان مثال سالمندی که فرزندان تحصیل کرده و موفقی به جامعه تحویل داده و این اعتبار و عزت را با ارزش ترین دارایی خود میداند از سلامت معنوی برخوردار است.",
      },
      {
        "subject_name": "قناعت ورزی",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "شکرگزاری برای داراییها پرهیز از اسراف و زندگی بر مدار قناعت و نیز همنشینی با افراد قناعت پیشه از معانی قناعت ورزی در موقعیت کاهش درآمد مالی است.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در موقعیت بی آرمانی",
    "subject_id": SUBJECTS.LOSS_OF_ASPIRATION.value,
    "secondary_subjects": [
      {
        "subject_name": "معاد اندیشی و تداوم تعالی خواهی",
        "aspect": "شناخت",
        "relational_reference": "خدا",
        "description": "زمانی که سالمند بتواند مبتنی بر حب ذات که فطری همه انسانها است به تعالی خود بیاندیشد و با توجه به در پیش داشتن معاد کماکان به دنبال رشد و تعالی باشد و در واقع تداوم نگری در زندگی داشته باشد، معاداندیش بوده و تعالی خواهی او تداوم دارد.",
      },
      {
        "subject_name": "توسعه خود",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "توسعه خود زمانی اتفاق می افتد که سالمند به دنبال وسعت بخشی خود بوده و عقیده دارد هنوز با وجود کهولت سن قادر به ایجاد تغییر در وجود خود است. همچنین با کمک به رشد دیگران میتواند اسباب توسعه خود را نیز فراهم سازد.",
      },
      {
        "subject_name": "حفظ خیال",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "از آنجا که یکی از موانع آرمان یابی افکار منفی و مایوس کننده است سالمند دارای سلامت معنوی با غوطه ور نشدن در گرداب افکار یاس آور سوق دادن افکار به سمت امیدواری قادر به حفظ پرنده خیال خود خواهد بود.",
      },
    ],
  },
  {
    "subject_name": "سلامت معنوی در مواجهه با نیاز به یکپارچگی زندگی",
    "subject_id": SUBJECTS.LIFE_INTEGRITY.value,
    "secondary_subjects": [
      {
        "subject_name": "خودارزیابی خردمندانه",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "در این مرحله اگر سالمند بتواند با مرور وسع مدار زندگی خود را بررسی کرده سپس بر مبنای معیارهای توحیدی به ارزیابی مسیر طی شده در زندگی اش بپردازد به خودارزیابی خردمندانه دست یافته است.",
      },
      {
        "subject_name": "ارتباط جویی حال و گذشته",
        "aspect": "شناخت",
        "relational_reference": "خود",
        "description": "سالمند دارای سلامت معنوی قادر است زندگی خود را با هدف یافتن ارتباط بین حال و گذشته و نیز انسجام یابی مرور و بررسی کند.",
      },
      {
        "subject_name": "خود اصلاحگری مشفقانه",
        "aspect": "رفتار",
        "relational_reference": "خود",
        "description": "خود اصلاحگری مشفقانه در گام اول به معنای پشیمانی از اشتباهات گذشته و توبه، سپس اقدام برای تغيير و تلاش برای جبران در صورت اماکن است در نهایت فردی که بتواند خود را ببخشد به خود اصلاحگری مشفقانه دست یافته است.",
      },
    ],
  },
]
